# Pandas

## Task 1

You should import the necessary libraries. You will use `numpy` and `pandas` libraries.


> Don't forget to import `numpy`, and `pandas` in short form.

In [10]:
import pandas as pd
import numpy as np
from datetime import datetime

from pandas.core.interchange.dataframe_protocol import DataFrame

## Task 2

Create a `DataFrame` from the given dictionary `data`.

In [4]:
data = {
    "Name": ["John", "Emily", "Ryan"],
    "Age": [16, 28, 22],
    "City": ["New York", "Los Angeles", "Chicago"],
}

df = pd.DataFrame(data)
df

# write your code here

    Name  Age         City
0   John   16     New York
1  Emily   28  Los Angeles
2   Ryan   22      Chicago

## Task 3

In this task you should complete the following steps:

### Task 3.1
Display all data for `Age` column for the DataFrame you created in the previous task.

In [5]:
df["Age"]

0    16
1    28
2    22
Name: Age, dtype: int64

### Task 3.2

Add `Salary` column to the `DataFrame` with the values `[50000, 60000, 45000]`.

In [7]:
df["Salary"] = [50000, 60000, 45000]
df

    Name  Age         City  Salary
0   John   16     New York   50000
1  Emily   28  Los Angeles   60000
2   Ryan   22      Chicago   45000

### Task 3.3

Filter the `DataFrame` to show only the rows with the `Age` greater than 18.

In [8]:
df[df["Age"] > 18]

    Name  Age         City  Salary
1  Emily   28  Los Angeles   60000
2   Ryan   22      Chicago   45000

## Task 4

In this task you should complete the following steps:

### Task 4.1

Add new calculated field `Birth year`;

In [11]:
current_year = datetime.now().year
df["BirthYear"] = current_year - df["Age"]
df

    Name  Age         City  Salary  BirthYear
0   John   16     New York   50000       2008
1  Emily   28  Los Angeles   60000       1996
2   Ryan   22      Chicago   45000       2002

### Task 4.2

Add new calculated field `Average age`.

In [12]:
average_age = df["Age"].mean()
df["AverageAge"] = average_age
df

    Name  Age         City  Salary  BirthYear  AverageAge
0   John   16     New York   50000       2008        22.0
1  Emily   28  Los Angeles   60000       1996        22.0
2   Ryan   22      Chicago   45000       2002        22.0

### Task 4.3

Calculate absolute difference between `Age` and `Average age`.

In [13]:
df["Difference"] = abs(df["Age"] - df["AverageAge"])
df

    Name  Age         City  Salary  BirthYear  AverageAge  Difference
0   John   16     New York   50000       2008        22.0         6.0
1  Emily   28  Los Angeles   60000       1996        22.0         6.0
2   Ryan   22      Chicago   45000       2002        22.0         0.0

## Task 5

Complete the following tasks described below.

### Task 5.1

You have two dictionaries `data1` and `data2`. Create two `DataFrame` objects from these dictionaries. Then, `concatenate`, and `merge` these two `DataFrame` objects into one `DataFrame` object, and see the difference.

In [22]:
# Data
data1 = {'Name': ['John', 'Emily', 'Ryan'],
         'Age': [25, 28, 22]}
data2 = {'Name': ['Emily', 'Ryan', 'Mike'],
         'City': ['Los Angeles', 'Chicago', 'Houston']}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df_concat = pd.concat([df1, df2])
df_merged = pd.merge(df1, df2, on="Name", how="outer")
df_merged

# create DataFrame objects

    Name   Age         City
0  Emily  28.0  Los Angeles
1   John  25.0          NaN
2   Mike   NaN      Houston
3   Ryan  22.0      Chicago

In [22]:
# merge

In [24]:
# concatenate

### Task 5.2

You have two `Series` objects `s1` and `s2`. Make default mathematical operations on these two `Series` objects. Such as `+`, `-`, `*`, `/`, `**`, `//`, `%`. Also, filter `s1` and print only even numbers, and `s2` only with odd numbers.

In [33]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([6, 7, 8, 9, 10])

0     1
1     4
2     9
3    16
4    25
dtype: int64

In [34]:
sum_ = s1 + s2

In [35]:
sub_ = s1 - s2

In [ ]:
mul_ = s1 * s2

In [ ]:
div_ = s1 / s2

In [ ]:
pow_ = s1 ** 2

In [ ]:
div_rem_ = s1 // s2

In [ ]:
per_ = s1 % s2

In [ ]:
s1_sorted = s1[s1 % 2 == 0]

In [ ]:
s2_sorted = s2[s2 % 2 != 0]

### Task 5.3

You have a `Serias` object `s`. Make the following operations on this `Series` object:

* make all words in uppercase without loops;
* get length of each word without loops.

In [37]:
s = pd.Series(["numpy", "pandas", "matplotlib"])

In [39]:
uppercase_s = s.str.upper()
uppercase_s

0         NUMPY
1        PANDAS
2    MATPLOTLIB
dtype: object

In [38]:
words_len = s.str.len()
words_len

0     5
1     6
2    10
dtype: int64

## Task 6 Optional

You have a large dataset consisting of a series of numbers. Your task is to calculate the moving average of the series using a window of `5` elements. The moving average is the average of a set of consecutive values in the series, where the window `slides` through the series to compute the average at each position. The goal is to calculate the moving average efficiently and accurately. Also, compare time performance of Python and Pandas solutions.

> Please, note: If you get `nan` while calculating the moving average, you should remove it from the result. Pandas solution should take 1-2 lines of code.

### Python Solution

In the Python solution, a large dataset is generated using random numbers. The moving average is computed by iterating over the dataset using a loop. At each position, a window of 5 elements is created, and the average is calculated by summing the values in the window and dividing by 5.

In [ ]:
import random

def unknown_signature():
    # Generate a large dataset
    data = [random.randint(1, 100) for _ in range(10000000)]

    # Calculate the moving average with a window of 5
    moving_averages = []
    for i in range(4, len(data)):
        window = data[i - 4 : i + 1]
        average = sum(window) / 5
        moving_averages.append(average)
    return moving_averages[:10]

%time unknown_signature()

### Solution using Pandas and Numpy

In [ ]:
# write your code here